Торговля_11__демо/src/InformationRegisters/НастройкиЧастичногоВыбытияТоваровИСМП/НастройкиЧастичногоВыбытияТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЧастичногоВыбытияТоваровИСМП</name>
  <attributes>
    <name>НоменклатураЧастичногоВыбытия</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаЧастичногоВыбытия</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/НастройкиЧастичногоВыбытияТоваровИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьОписание(Номенклатура, Характеристика) Экспорт
	
	ВозвращаемоеЗначение = Новый  Структура;
	ВозвращаемоеЗначение.Вставить("НоменклатураНастроена",           Ложь);
	ВозвращаемоеЗначение.Вставить("НоменклатураЧастичногоВыбытия",   ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура"));
	ВозвращаемоеЗначение.Вставить("ХарактеристикаЧастичногоВыбытия", ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА                                                                КАК НоменклатураНастроена,
		|	НастройкиЧастичногоВыбытияТоваровИСМП.НоменклатураЧастичногоВыбытия   КАК НоменклатураЧастичногоВыбытия,
		|	НастройкиЧастичногоВыбытияТоваровИСМП.ХарактеристикаЧастичногоВыбытия КАК ХарактеристикаЧастичногоВыбытия
		|ИЗ
		|	РегистрСведений.НастройкиЧастичногоВыбытияТоваровИСМП КАК НастройкиЧастичногоВыбытияТоваровИСМП
		|ГДЕ
		|	НастройкиЧастичногоВыбытияТоваровИСМП.Номенклатура = &Номенклатура
		|	И НастройкиЧастичногоВыбытияТоваровИСМП.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЭтоНастроенноеВыбытие(Номенклатура, Характеристика, НоменклатураЧастичногоВыбытия, ХарактеристикаЧастичногоВыбытия) Экспорт
	
	Описание = ПолучитьОписание(Номенклатура, Характеристика);
	
	Возврат (Описание.НоменклатураНастроена
		И Описание.НоменклатураЧастичногоВыбытия = НоменклатураЧастичногоВыбытия
		И Описание.ХарактеристикаЧастичногоВыбытия = ХарактеристикаЧастичногоВыбытия);
	
КонецФункции

#КонецОбласти

#КонецЕсли
